# 3'. Задайте последовательность чисел. 
# Напишите программу, которая выведет список 
# неповторяющихся элементов исходной последовательности.


a = [1, 8, 1, 23, 22, 1, 4, 4, 56]
b = set(a)
print(b)

